Revit 2015 API
SlabFoundationType Enumeration
SlabFoundation type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public enum SlabFoundationType
Visual Basic
Public Enumeration SlabFoundationType
Visual C++
public enum class SlabFoundationType
Members
Member name | Description
SlabOneWay | SlabFoundationType is SlabOneWay.
SlabFoundation | SlabFoundationType is SlabFoundation.
SlabOnGrade | SlabFoundationType is SlabOnGrade.
SlabTwoWay | SlabFoundationType is SlabTwoWay.
See Also
Autodesk.Revit.DB.Structure Namespace